[
  {
    "nome_vila": "Amegakure",
    "historia_vila": "Amegakure (雨隠れの里, Amegakure no Sato, literally meaning: Village Hidden by Rain) is a small but highly industrialized hidden village located in an unnamed country. As its name suggests, it rains almost constantly in Amegakure and the surrounding area. All the water seemingly ends in a large lake that surrounds the village.",
    "imagem_vila":"https://staticg.sportskeeda.com/editor/2022/05/b8fb5-16536435034219-1920.jpg?w=840"
  },
  {
    "nome_vila": "Bamboo Village",
    "historia_vila": "The Bamboo Village (竹ノ村, Take no Mura) is a small village in the Land of Hot Water. It is surrounded by a forest of bamboo, and as such, most of the village's buildings and goods are made out of bamboo. Because it is a remote village, the villagers received aid from the Lightning Group in the past. When the Lightning Group came into conflict with Kirigakure, its surviving members sought refuge in Bamboo Village. The villagers refused to help them, fearing reprisal from Kiri. Years later, this rejection of the Lightning Group caused Bamboo Village to be attacked by the Dark Thunder Group, but the village was saved by Sasuke Uchiha.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/4/45/Bamboo_Village.png"
  },
  {
    "nome_vila": "Ceramic Village",
    "historia_vila": "The Ceramic Village (陶の里, Chori no Sato) was a small village in the Land of Wind, near the border with the Land of Rivers. The area surrounding the village was not as barren as most of the country, being well-forested. Per its name, the village was famous for its ceramics, the clay for which was gathered from the surrounding area. Ceramic tiles adorned all of the village's buildings, and tall chimneys for kilns were common throughout.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/0/01/Hoshigakure.png"
  },
  {
    "nome_vila": "Daidai Village",
    "historia_vila": "Daidai Village is a small village located in an unknown country in the Naruto world. Little is known about the Daidai village. The origins and history of the Daidai Village are a mystery to all. The only known fact about this village is that it is the residence of the Yoimura clan. Other than this small detail, nothing is known about Daidai Village.",
    "imagem_vila":"null"
  },
  {
    "nome_vila": "Genjutsu Tree Village",
    "historia_vila": "This unnamed village is hidden among special trees that produce a genjutsu-like effect, thus protecting the village from invaders. Naruto and Jiraiya came to the village to hone Naruto's genjutsu-repelling abilities. Villagers use Chilli Pepper Bombs to counter the genjutsu-like effects. There, they encountered Kandachi and his helpers. With the help of Tanishi, Naruto and Jiraiya managed to defeat their foe.",
    "imagem_vila":"https://i.pinimg.com/originals/27/69/91/2769916cc9b59583012ccf44b4218c7b.png"
  },
  {
    "nome_vila": "Hachō Village",
    "historia_vila": "The Hachō Village (ハチョウ村, Hachō-mura) is a village lying on the outskirts of the border of the Land of Fire. They are on very friendly terms with the Tonika Village. When the village was attacked by Kabuto Yakushi in his attempt to gain access to The Hole, the villagers that survived all fled to this village, and the Hachō Village later sent officers to help guard the ruined village. Disonasu, the village head, also went to the Tonika Village to aid in the village's rehabilitation.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/8/87/Hacho_village.png"
  },
  {
    "nome_vila": "Hoshigakure",
    "historia_vila": "Hoshigakure (星隠れの里, Hoshigakure no Sato, literally meaning: Village Hidden Among Stars) was introduced during the Star Guard Mission. It was founded by the First Hoshikage two hundred years before the start of the series and is located in the Land of Bears. It is also one of the lesser-known shinobi villages in the Naruto universe.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/a/a6/Hoshikage%27s_Residence.png"
  },
  {
    "nome_vila": "Howling Wolf Village",
    "historia_vila": "The Howling Wolf Village (狼哭の里, Rōkoku no Sato) was originally a settlement of the Kodon clan. Since ancient times, the settlement was periodically attacked by Rōen, a wolf-like monster. The Kodon eventually found a way to seal Rōen, bringing peace to the region and leading non-Kodon to settle in the village. By selling medicines and offering modest shinobi services, the Howling Wolf was able to support itself as a hidden village.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/5/5e/Yumegakure.png"
  },
  {
    "nome_vila": "Inaho Village",
    "historia_vila": "Inaho Village (稲穂村, Inaho-mura, English TV: Rice Village) is located near the hills where Genmai was kidnapped.",
    "imagem_vila":"https://media.pokemoncentral.it/wiki/thumb/3/3d/Accademia_Pok%C3%A9mon_dei_ninja.png/200px-Accademia_Pok%C3%A9mon_dei_ninja.png"
  },
  {
    "nome_vila": "Ishigakure",
    "historia_vila": "Ishigakure (石隠れの里, Ishigakure no Sato, Viz: Hidden Rock Village, literally meaning: Village Hidden in Stones) is the hidden village of the country located between the Land of Earth and the Land of Wind. In Gaara Hiden, several terrorists with kekkei genkai hail from this village.",
    "imagem_vila":"https://static.wikia.nocookie.net/narutofanon/images/9/9d/Ishigakure.jpg"
  },
  {
    "nome_vila": "Iwagakure",
    "historia_vila": "Iwagakure (岩隠れの里, Iwagakure no Sato, English TV: Hidden Stone Village, literally meaning: Village Hidden by Rocks) is the hidden village of the Land of Earth. As the village of one of the Five Great Shinobi Countries, Iwagakure has a Kage as its leader known as the Tsuchikage, of which there have been four in its history. The rocky mountain ranges that surround the village provide a natural stronghold. The village's infrastructure is built from much of the surrounding rock and stone, shaped into tower-like structures that are inter-connected by a network of bridges. The Tsuchikage's residence seems to be the tallest structure with a cone-shaped roof and bears the kanji for Earth (土, Tsuchi) on it.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/e/e4/Iwagakure_no_Sato.png"
  },
  {
    "nome_vila": "Jōmae Village",
    "historia_vila": "The Jōmae Village (錠前の里, Jōmae no Sato, literally meaning: Lock Village) is an anime-only shinobi village located in the Land of Keys. This village's shinobi are experts in espionage in order to gain information for negotiations with larger, more powerful nations. In this village, ninja seem to be specifically trained in gaining information while giving none in return, as evidenced by Hanare's Eye Mind Reading technique and their leader's willingness to commit suicide rather than be taken hostage by enemy ninja.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/1/1e/Land_of_Keys.png"
  },
  {
    "nome_vila": "Kagerō Village",
    "historia_vila": "Kagerō Village (陽炎の里, Kagerō no Sato, English TV: Heat Devil Village, literally meaning: Heat Haze Village) was a small village located in the Land of Mountains. Thirty years before the start of the series, it was at war with Konoha. Three months after a surprise attack by the Third Hokage, Jiraiya, and several other Konoha ninja, they declared a cease-fire. Two weeks later, however, they were wiped out by shinobi from Tanigakure. Only Gennō, who had been in Konoha at the time planting explosive tags for a possible counter-attack, survived its destruction.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/d/d3/Yugakure.PNG/"
  },
  {
    "nome_vila": "Kirigakure",
    "historia_vila": "Kirigakure (霧隠れの里, Kirigakure no Sato, English TV: Village Hidden in the Mist, literally meaning: Village Hidden by Mist) is the hidden village of the Land of Water. As the village of one of the Five Great Shinobi Countries, Kiri has a Kage as its leader known as the Mizukage, of which there have been six in its history. Befitting its name, the village is surrounded by a thick mist, with several mountains in the background, making it difficult to find by foreigners. Kirigakure's architecture is composed of several cylindrical buildings, with the Mizukage's office being the widest and largest. Most of the buildings have vegetation growing on their roofs.",
    "imagem_vila":"https://staticg.sportskeeda.com/editor/2022/06/89ae3-16542408361328.png"
  },
  {
    "nome_vila": "Konohagakure",
    "historia_vila": "Konohagakure (木ノ葉隠れの里, Konohagakure no Sato, literally meaning: Village Hidden by Tree Leaves) is the hidden village of the Land of Fire. As the village of one of the Five Great Shinobi Countries, Konohagakure has a Kage as its leader known as the Hokage, of which there have been eight in its history. Konoha resides deep in a forest at the base of a mountain known as the Hokage Rock, which has the faces of all those who have taken the position of Hokage carved into it. It is surrounded on all sides by enormous walls. Although generally seen as the most powerful of the ninja villages, Konoha has enjoyed many years of relative peace and stability.",
    "imagem_vila":"https://static1.cbrimages.com/wordpress/wp-content/uploads/2020/03/Konohagakure.jpg"
  },
  {
    "nome_vila": "Kumogakure",
    "historia_vila": "Kumogakure (雲隠れの里, Kumogakure no Sato, English TV: Hidden Cloud Village, literally meaning: Village Hidden by Clouds) is the hidden village of the Land of Lightning and was founded by the First Raikage. As the village of one of the Five Great Shinobi Countries, Kumogakure has a Kage as its leader known as the Raikage, of which there have been five in its history. The village is located in a range of tall mountains and is literally hidden in the clouds. The Raikage works in a large blue structure built into the tallest mountain.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/5/5a/Kumogakure.png"
  },
  {
    "nome_vila": "Kusagakure",
    "historia_vila": "Kusagakure (草隠れの里, Kusagakure no Sato, literally meaning: Village Hidden in the Grass) is located in an unnamed country. Because it had genin participating in the Chūnin Exams organized by Konohagakure, it can be assumed the two villages are allied. Although it has never been named, the country Kusagakure is located in has been shown on several occasions. The country is rich with forests, some consisting of giant mushrooms or bamboo. It also seems to have many rivers and deep ravines. During the Third Shinobi World War, the country was invaded by Iwagakure and served as an important front between Iwa and Konoha. More than a decade later, Orochimaru had a hideout somewhere in the country.",
    "imagem_vila":"https://static.wikia.nocookie.net/narutoprofile/images/7/79/Kusagakure.jpg"
  },
  {
    "nome_vila": "Mount Myōboku",
    "historia_vila": "Mount Myōboku (妙木山, Myōbokuzan, literally meaning: Mysterious/Exquisite Tree Mountain), also known as the Mountain of Bewilderment (迷いの山, Mayoi no Yama, Viz: Maze Mountain) and the Land of Toads (蝦蟇の国, Gama no Kuni), is one of the big three unexplored sage regions, a legendary place as famous as the other two, Shikkotsu Forest and Ryūchi Cave. It's the land of toads and the place where all the toads that Naruto, Minato, and Jiraiya have summoned live. It is home to huge and small toads alike. Mount Myōboku is a rich and beautiful land, whose ultimate authority seems to be the Great Toad Sage. Shima and Fukasaku are both elders and sages, and they seem to have even higher authority than Gamabunta himself.",
    "imagem_vila":"https://i.pinimg.com/originals/7c/14/f6/7c14f60b3523bbf845dff36d5b5180de.jpg"
  },
  {
    "nome_vila": "Nadeshiko Village",
    "historia_vila": "The Nadeshiko Village (撫子の里, Nadeshiko no Sato) is a shinobi village located near the Land of Water. The families of this village are organized through matrilineality. Women from this village must venture outside to find men strong enough to defeat them, resulting in them being taken to the village to marry the kunoichi they defeated. The village itself is positioned upon the lightly forested top of three massive and steep hills standing in a line, with two bridges spanning the gorges between them. The hills are situated within a lush forested valley in a mountainous region. In terms of construction, the village seems to be similar to a stronghold or palace, with numerous walls, towers, and brickwork being dominant features.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/f/f2/Nadeshiko_village.png"
  },
  {
    "nome_vila": "Otogakure",
    "historia_vila": "Otogakure (音隠れの里, Otogakure no Sato, English TV: Village Hidden in the Sound, literally meaning: Village Hidden by Sound) is the personal hidden village of Orochimaru, which was founded after he left the Akatsuki for the express purpose of collecting ninja for his experiments and his quest to learn all techniques. In later years, following Orochimaru's new appreciation for natural development of people and making a truce with Konohagakure, Otogakure was reestablished as a legitimate shinobi village.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/d/d1/Orochimaru%27s_Island_Laboratory_anime.png"
  },
  {
    "nome_vila": "Ryūchi Cave",
    "historia_vila": "Ryūchi Cave (龍地洞, Ryūchidō, literally meaning: Dragon Ground Cave) is one of the big three unexplored sage regions, a legendary place as famous as the other two, Mount Myōboku and Shikkotsu Forest. It is the residence of the snakes — including the sacred White Snake Sage — and is also where Orochimaru uncovered the source of Jūgo's clan's abilities. Orochimaru and Kabuto Yakushi trained here to achieve Sage Mode, though only the latter was successful in this endeavor.",
    "imagem_vila":"https://pm1.aminoapps.com/6393/6de72828d837aa2a72384691e06dd4a11934b1df_00.jpg"
  },
  {
    "nome_vila": "Shikkotsu Forest",
    "historia_vila": "The Shikkotsu Forest (湿骨林, Shikkotsurin, English TV: Shikkotsu Woods, literally meaning: Damp Bone Forest) is a legendary place and one of the three unexplored sage regions; the other two being Mount Myōboku and Ryūchi Cave. It is the home of the slug Katsuyu, parts of which are summoned by Tsunade and her disciple Sakura Haruno.",
    "imagem_vila":"https://d.wattpad.com/story_parts/119/images/160c20ca29f612fa183602733611.jpg"
  },
  {
    "nome_vila": "Sunagakure",
    "historia_vila": "Sunagakure (砂隠れの里, Sunagakure no Sato, literally meaning: Village Hidden by Sand) is the hidden village of the Land of Wind. As the village of one of the Five Great Shinobi Countries, Sunagakure has a Kage as its leader known as the Kazekage, of which there have been five in its history. Being surrounded by desert offers the village a natural deterrent against invasion, as few foreign powers would be willing to endure the sandstorms and water scarcity common to Suna. Sunagakure itself lies in a fortified valley behind cliffs of rock, with passage in and out of the village restricted to a single cleft between two cliff faces, making the area very hard to attack from the ground. The buildings inside seem to be made of clay or stucco, which would help to keep the buildings cool.",
    "imagem_vila":"https://static.wikia.nocookie.net/kakashiforum/images/8/81/Sunagakure.PNG"
  },
  {
    "nome_vila": "Takumi Village",
    "historia_vila": "Takumi Village (匠の里, Takumi no Sato, literally meaning: Village of Artisans) is an anime-only village that resides in the Land of Rivers. It was founded approximately one hundred years ago by a man named Seimei. Takumi is known for its skills in making weaponry, many of which are sold to the ninja villages of the world. However, each time relations worsened between the larger villages, Takumi was attacked by one village over fear of their ninja tools crossing to the other village. Yet they still had to curry favor with the larger villages to survive. Over time, their clientele from the other villages grew in skill, making the crafted weapons obsolete. When the village faced hard times, they requested help but were ignored. Certain skilled Takumi villagers grew resentful and felt the villages didn't respect them for all the help their weapons provided in the past, having repaid their aid with attacks in the past.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/8/88/Takumi_Village.png"
  },
  {
    "nome_vila": "Takigakure",
    "historia_vila": "Takigakure (滝隠れの里, Takigakure no Sato, literally meaning: Village Hidden by a Waterfall) is a village located in an unnamed country. In terms of the village's appearance, Takigakure seems to be based on mostly Southeast Asian aesthetics. Their current leader is Shibuki.",
    "imagem_vila":"https://static.wikia.nocookie.net/the-naruto-world/images/b/bc/Takigakure.png"
  },
  {
    "nome_vila": "Tonika Village",
    "historia_vila": "The Tonika Village (トニカ村, Tonika-mura) is a village located on the outskirts of the border of the Land of Fire. It is also where The Hole is located. The village was destroyed during Kabuto Yakushi's invasion, which was geared towards acquiring The Hole to conduct his experiments. During the invasion, the villagers fought bravely to defend their home, but Kabuto's reincarnated pawns were too powerful and overwhelming. During this time, Dokku instructed Miina and Leo to flee to the Hachō Village, which is a friendly neighboring town.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/3/36/Tonika_village.png"
  },
  {
    "nome_vila": "Tsuchigumo Village",
    "historia_vila": "The Tsuchigumo village is the village of the Tsuchigumo clan. It is led by the Tsuchigumo chief. This village is composed of the members of the Tsuchigumo clan who refused to follow En no Gyōja to Mount Katsuragi, and consequently denied the Tsuchigumo clan kinjutsu. They were made into pawns by the Magaki Group, who sought the kinjutsu.",
    "imagem_vila":"https://static.wikia.nocookie.net/naruto/images/a/a7/Tsuchigumo_Village.png"
  },
  {
    "nome_vila": "Tsukigakure",
    "historia_vila": "Tsukigakure (月隠れの里, Tsukigakure no Sato, English: Hidden Moon Village, literally meaning: Village Hidden under the Moon) is a hidden village led by Tsukino, who succeeded her father after he died. They have a hereditary system and so positions are passed down to the next generation. It is a custom for the people of Tsukigakure to always give strangers and newcomers warm welcomes, because of an ancient legend of the village.",
    "imagem_vila":"https://static.wikia.nocookie.net/thenarutofanon/images/8/8d/Image_%281%29.jpg"
  }
]
